messages = {
    'ru': {
        'cancel': 'Отмена',  # Текст для кнопки отмены на русском
        'welcome': "Привет, {user_name}! 😊\n\nДобро пожаловать в бот Окурмен Академии! 🎓\nЗдесь менторы готовы помочь вам улучшить навыки программирования и решить любые ваши вопросы. 💻\nЕсли вам нужна помощь, воспользуйтесь кнопками ниже. 👇\n\nМы всегда рады вам помочь! 💬",
        'about_message': (
            "🤖 О боте\n\n"
            "Добро пожаловать в бот Окурмен Академии! 🎓\n"
            "Этот бот создан, чтобы помочь студентам улучшить навыки программирования и получить поддержку от опытных менторов. 💻\n\n"
            "🌟 **Функционал бота:**\n"
            "- Задавайте свои вопросы и получайте помощь от менторов.\n"
            "- Оставляйте отзывы о нашей работе.\n"
            "- Узнавайте больше о наших услугах.\n\n"
            "🛠 **Разработчик:** @duishobaevislam01\n"
            "💬 Для вопросов и предложений нажмите кнопку ниже. 👇"
        ),
        'help_message': """
❓ **Как работают кнопки?**

Вот, как работают кнопки в этом боте:

1. 🆘 **Запросить помощь** — Нажав эту кнопку, вы можете отправить запрос на помощь. Это будет передано нашему ментору, который свяжется с вами, чтобы помочь решить проблему.

2. ℹ️ **О боте** — Получите информацию о боте, кто его создал и как он может помочь вам.

3. ❓ **Помощь** — Нажмите эту кнопку, чтобы узнать, как получить поддержку и какие функции доступны в боте.

4. ⭐ **Оставить отзыв** — Если вам понравился бот или у вас есть предложения, нажмите эту кнопку, чтобы оставить отзыв.

5. 🤖 **Помощь от ИИ** — Нажмите эту кнопку, чтобы получить помощь от ИИ. Он поможет вам с базовыми вопросами или заданиями по программированию.

6. 🌐 **Выбор языка** — Выберите язык интерфейса бота. Доступны несколько языков: русский, кыргызский и английский.
        """,
        "review": "💬 Пожалуйста, оставьте отзыв о нашем боте. Ваше мнение важно для нас!",
        "review_thanks": "Спасибо за ваш отзыв! Мы ценим ваше мнение и обязательно учтем его для улучшения бота.",
        'enter_fullname': '📝 Пожалуйста, введите ваше полное имя.',
        'enter_group': '📚 Введите вашу группу.',
        'describe_problem': '🔧 Опишите вашу проблему.',
        'describe_problem_media': '📸 Если у вас есть медиафайлы, отправьте их, чтобы я мог вам помочь.',
        'request_sent': '✅ Ваш запрос был отправлен, мы скоро свяжемся с вами.',
        'ai_help_message': "Какую помощь вам нужно? 🤔 Я могу помочь! 👐",  # Русский язык
        'request_canceled': "Ваш запрос был отменен. ❌",
        'review_invalid': "Ваш запрос недействителен, попробуйте снова. 📝🔄",
        'review_sent': "Ваш запрос успешно отправлен! ✅"

    },
    'kgz': {
        'cancel':"Токтотуу",
        'welcome': "Салам, {user_name}! 😊\n\nОкурмен Академиясынын ботуна кош келиңиз! 🎓\nБул жерде менторлор программалоо боюнча суроолоруңузду чечүүгө жардам беришет. 💻\nЭгер жардам керек болсо, төмөндөгү баскычтарды колдонуңуз. 👇\n\nБиз сизге ар дайым жардам берүүгө даярбыз! 💬",
        'about_message': (
            "🤖 Бот жөнүндө\n\n"
            "Окурмен Академиясынын ботуна кош келиңиз! 🎓\n"
            "Бул бот студенттерге программалоо боюнча өз көндүмдөрүн өркүндөтүүгө жана тажрыйбалуу менторлордон "
            "жардам алууга жардам берүү үчүн түзүлгөн. 💻\n\n"
            "🌟 **Боттун функциялары:**\n"
            "- Суроолоруңузду берип, менторлордон жардам алыңыз.\n"
            "- Биздин иш жөнүндө пикир калтырыңыз.\n"
            "- Биздин кызматтар жөнүндө көбүрөөк билүү.\n\n"
            "🛠 **Разработчик:** @duishobaevislam01\n"
            "💬 Суроолор жана сунуштар үчүн төмөнкү баскычты басыңыз. 👇"
        ),
        'help_message': """
❓ **Кнопкалар кантип иштейт?**

Мына, бул боттогу кнопкалар кантип иштейт:

1. 🆘 **Жардам сура** — Бул кнопканы басып, сиз жардам сурай аласыз. Суроо менторго жөнөтүлөт, ал сиз менен байланышып, көйгөйүңүздү чечүүгө жардам берет.

2. ℹ️ **О боте** — Бот тууралуу маалымат алууга болот, аны ким иштеп чыккан жана кандай жардам көрсөтө алаары жөнүндө.

3. ❓ **Жардам** — Бул кнопканы басып, боттун жардамын жана анын кандай функциялары бар экенин биле аласыз.

4. ⭐ **Отзывы калтыруу** — Эгерде сизге бот жакса же сунуштарыңыз болсо, бул кнопканы басып, пикир калтырыңыз.

5. 🤖 **ИИ жардам** — Бул кнопканы басып, ИИден жардам ала аласыз. Ал сизге программалоо боюнча негизги суроолорго жардам берет.

6. 🌐 **Тил тандоо** — Боттун интерфейсинин тилин тандаңыз. Орусча, кыргызча жана англисче тилдери бар.
        """,
        "review": "💬 Биздин бот тууралуу пикир калтырыңыз. Сиздин пикир өтө маанилүү!",
        "review_thanks": "Пикириңиз үчүн ыраазычылыгыбызды билдиребиз! Биздин ботту жакшыртуу үчүн ал көзөмөлгө алынат.",
        'enter_fullname': '📝 Өз атыңызды жазыңыз.',
        'enter_group': '📚 Группанызды жазыңыз.',
        'describe_problem': '🔧 М probleeminizi сүрөттөп бериңиз.',
        'describe_problem_media': '📸 Эгерде сизде медиа файлдар болсо, аларды жиберип, мен сизге жардам бере алам.',
        'request_sent': '✅ Суранышыңыз жиберилди, биз жакын арада байланышка чыгабыз.',
        'ai_help_message': "Сизге кандай жардам керек? 🤔 Мен жардам бере алам! 👐",
        'request_canceled': "жокко чыгардыңыз. ❌",
        'review_invalid': " кайрадан аракет кылыңыз. 📝🔄",
        'review_sent': "Суранычыңыз ийгиликтүү жөнөтүлдү! ✅"
        # Кыргизский язык
    },
    'en': {
        'cancel':"Cancel",
        'welcome': "Hello, {user_name}! 😊\n\nWelcome to the Okurmen Academy bot! 🎓\nHere, mentors are ready to help you improve your programming skills and solve any questions you have. 💻\nIf you need assistance, use the buttons below. 👇\n\nWe're always here to help! 💬",
        'about_message': (
            "🤖 About the bot\n\n"
            "Welcome to the Okurmen Academy bot! 🎓\n"
            "This bot was created to help students improve their programming skills and get support from experienced mentors. 💻\n\n"
            "🌟 **Bot features:**\n"
            "- Ask your questions and get help from mentors.\n"
            "- Leave feedback about our work.\n"
            "- Learn more about our services.\n\n"
            "🛠 **Developer:** @duishobaevislam01\n"
            "💬 For questions and suggestions, press the button below. 👇"
        ),
        'help_message': """
❓ **How do the buttons work?**

Here's how the buttons work in this bot:

1. 🆘 **Request help** — By pressing this button, you can send a help request. It will be forwarded to our mentor, who will contact you to assist with your problem.

2. ℹ️ **About the bot** — Get information about the bot, who created it, and how it can assist you.

3. ❓ **Help** — Press this button to learn how to get support and what features are available in the bot.

4. ⭐ **Leave a review** — If you like the bot or have suggestions, press this button to leave a review.

5. 🤖 **AI help** — Press this button to get help from AI. It will assist you with basic programming questions or tasks.

6. 🌐 **Select language** — Choose the bot's interface language. Available languages: Russian, Kyrgyz, and English.
        """,
        "review": "💬 Please leave a review about our bot. Your feedback is important to us!",
        "review_thanks": "Thank you for your review! We appreciate your feedback and will take it into account to improve the bot.",
        'enter_fullname': '📝 Please enter your full name.',
        'enter_group': '📚 Enter your group.',
        'describe_problem': '🔧 Describe your problem.',
        'describe_problem_media': '📸 If you have media files, send them so I can assist you.',
        'request_sent': '✅ Your request has been sent, we will contact you soon.',
        'ai_help_message': "What help do you need? 🤔 I can assist you! 👐",  # Английский язык
        'request_canceled': "Your request has been canceled. ❌",
        'review_invalid': "Your request is invalid, please try again. 📝🔄",
        'review_sent': "Your request has been successfully sent! ✅"
    },
}
button_texts = {
    'ru': {
        'send_help_request': 'Отправить запрос',
        'leave_review': 'Оставить отзыв',
        'about_bot': 'О боте',
        'help': 'Помощь',
        'select_language': 'Выбрать язык',
        'ai_help': 'Помощь у ИИ',
        'return_menu': "🔙 Вернуться в главное меню",
    },
    'kgz': {
        'send_help_request': 'Суроо жөнөтүү',
        'leave_review': 'Пикир калтыруу',
        'about_bot': 'Бот жөнүндө',
        'help': 'Жардам',
        'select_language': 'Тилди тандаңыз',
        'ai_help': 'ИИден жардам',
        'return_menu': "🔙 Башкы менюга кайтуу",
    },
    'en': {
        'send_help_request': 'Send Help Request',
        'leave_review': 'Leave a Review',
        'about_bot': 'About Bot',
        'help': 'Help',
        'select_language': 'Select Language',
        'ai_help': 'AI Assistance',
        'return_menu': "🔙 Return to Main Menu",
    },
}
cancel = {
    'ru': "Отмена",
    'en': "Cancel",
    'kgz': "Токтотуу"
}
